Revit 2027 API
BuiltInFailures.WallFailures.EmbeddedButShouldNotBe Property
 Conditions for wall embedding are no longer satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EmbeddedButShouldNotBe { get; }
Public Shared ReadOnly Property EmbeddedButShouldNotBe As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EmbeddedButShouldNotBe {
	FailureDefinitionId^ get ();
}
static member EmbeddedButShouldNotBe : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace